app/Controllers/Api/WhatsAppHistory.php

SELECT `t`.*, `c`.`wa_number`, `c`.`contact_name`
FROM `wa_support_tickets` `t`
JOIN `wa_chats` `c` ON `c`.`id` = `t`.`chat_id`
ORDER BY `t`.`updated_at` DESC
SELECT *
FROM `wa_messages`
WHERE `chat_id` = '5'
ORDER BY `id` ASC
---
    public function supportChats()
    {
        $db = db_connect();
        $tickets = $db->table('wa_support_tickets t')
            ->select('t.*, c.wa_number, c.contact_name')
            ->join('wa_chats c', 'c.id = t.chat_id')
            ->orderBy('t.updated_at', 'DESC')
            ->get()
            ->getResultArray();

        $result = [];

        foreach ($tickets as $ticket) {
            $messages = $db->table('wa_messages')
                ->where('chat_id', $ticket['chat_id'])
                ->orderBy('id', 'ASC')
                ->get()
                ->getResultArray();

SELECT `c`.*, COUNT(m.id) AS message_count, SUM(m.is_training_candidate = 1) AS training_candidate_count
FROM `wa_chats` `c`
LEFT JOIN `wa_messages` `m` ON `m`.`chat_id` = `c`.`id`
GROUP BY `c`.`id`
ORDER BY `c`.`last_message_at` DESC, `c`.`updated_at` DESC
---
    public function chats()
    {
        $db = db_connect();
        $keyword = trim((string) $this->request->getGet('q'));
        $status = trim((string) $this->request->getGet('status'));

        $builder = $db->table('wa_chats c')
            ->select('c.*, COUNT(m.id) AS message_count, SUM(m.is_training_candidate = 1) AS training_candidate_count')
            ->join('wa_messages m', 'm.chat_id = c.id', 'left')
            ->groupBy('c.id')
            ->orderBy('c.last_message_at', 'DESC')
            ->orderBy('c.updated_at', 'DESC');

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('c.wa_number', $keyword)
                ->orLike('c.contact_name', $keyword)
                ->orLike('c.last_message', $keyword)
                ->groupEnd();
        }

        if ($status !== '') {
            $builder->where('c.status', $status);
        }

        $chats = array_map(static function (array $chat): array {
            return [
                'id' => (int) $chat['id'],
                'waNumber' => $chat['wa_number'],
                'contactName' => $chat['contact_name'],
                'status' => $chat['status'],
                'lastMessage' => $chat['last_message'],
                'lastMessageAt' => $chat['last_message_at'],
                'messageCount' => (int) $chat['message_count'],
                'trainingCandidateCount' => (int) $chat['training_candidate_count'],
                'createdAt' => $chat['created_at'],
                'updatedAt' => $chat['updated_at'],
            ];
        }, $builder->get()->getResultArray());

SELECT *
FROM `wa_chats`
WHERE `id` = 12
SELECT *
FROM `wa_messages`
WHERE `chat_id` = 12
ORDER BY `id` ASC
---
    public function chat($id)
    {
        $db = db_connect();
        $chat = $db->table('wa_chats')->where('id', (int) $id)->get()->getRowArray();

        if (!$chat) {
            return $this->failNotFound('Chat tidak ditemukan.');
        }

        $messages = $db->table('wa_messages')
            ->where('chat_id', (int) $id)
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();