app/Controllers/Chatbot.php

    private function upsertWebChat(string $sessionId, ?string $contactName = null): int
    {
        $db = db_connect();
        $number = 'WEB-' . substr(hash('sha256', $sessionId), 0, 16);
        $chat = $db->table('wa_chats')->where('wa_number', $number)->get()->getRowArray();
---
SELECT *
FROM `wa_chats`
WHERE `wa_number` = 'WEB-a66501507ad19fd6'

    private function insertMessage(int $chatId, string $direction, string $senderType, string $message, array $flags = []): int
    {
        $db = db_connect();
        $now = $this->now();

        $db->table('wa_messages')->insert(array_merge([
            'chat_id' => $chatId,
            'wa_message_id' => null,
            'direction' => $direction,
            'sender_type' => $senderType,
            'message' => $message,
            'answered_by_chatbot' => $senderType === 'bot' ? 1 : 0,
            'chatbot_understood' => null,
            'needs_cs' => 0,
            'is_training_candidate' => 0,
            'sent_at' => $now,
            'created_at' => $now,
            'updated_at' => $now,
        ], $flags));

        $messageId = (int) $db->insertID();

        $db->table('wa_chats')->where('id', $chatId)->update([
            'last_message' => $message,
            'last_message_at' => $now,
            'updated_at' => $now,
        ]);
---
INSERT INTO `wa_messages` (`chat_id`, `wa_message_id`, `direction`, `sender_type`, `message`, `answered_by_chatbot`, `chatbot_understood`, `needs_cs`, `is_training_candidate`, `sent_at`, `created_at`, `updated_at`) VALUES (6, NULL, 'incoming', 'user', 'halo', 0, NULL, 0, 0, '2026-05-07 03:28:41', '2026-05-07 03:28:41', '2026-05-07 03:28:41')
UPDATE `wa_chats` SET `last_message` = 'halo', `last_message_at` = '2026-05-07 03:28:41', `updated_at` = '2026-05-07 03:28:41'
WHERE `id` = 6

    public function chat()
    {
        $apiKey = getenv('GROQ_API_KEY');

        $input = $this->request->getJSON();
        $message = trim((string) ($input->message ?? ''));
        $source = strtolower(trim((string) ($input->source ?? '')));
        $isWebChat = $source === 'web';
        $chatId = null;
        $userMessageId = null;

        if ($message === '') {
            return $this->respond($this->choiceResponse('Maaf, pesan Anda kosong.'));
        }

        if ($isWebChat) {
            $webSessionId = trim((string) ($input->web_session_id ?? session_id()));
            $chatId = $this->upsertWebChat($webSessionId ?: session_id(), $input->contact_name ?? null);
            $userMessageId = $this->insertMessage($chatId, 'incoming', 'user', $message, [
                'answered_by_chatbot' => 0,
            ]);
        }

        $localAnswer = $this->findLocalAnswer($message);
        if ($localAnswer) {
            if ($isWebChat && $chatId) {
                $this->insertMessage($chatId, 'outgoing', 'bot', $localAnswer, [
                    'chatbot_understood' => 1,
                ]);
                db_connect()->table('wa_messages')->where('id', $userMessageId)->update([
                    'answered_by_chatbot' => 1,
                    'chatbot_understood' => 1,
                    'updated_at' => $this->now(),
                ]);
---
UPDATE `wa_messages` SET `answered_by_chatbot` = 1, `chatbot_understood` = 1, `updated_at` = '2026-05-07 03:28:41'
WHERE `id` = 85