app/Models/ChatbotIntentModel.php

SELECT *
FROM `chatbot_stopwords`
ORDER BY `word` ASC
SELECT *
FROM `chatbot_suffixes`
ORDER BY `suffix` ASC
SELECT *
FROM `chatbot_synonyms`
ORDER BY `word` ASC
---
    public function getNlpRuleDataset(): array
    {
        $this->ensureSchema();

        return [
            'stopwords' => $this->db->table('chatbot_stopwords')->orderBy('word', 'ASC')->get()->getResultArray(),
            'suffixes' => $this->db->table('chatbot_suffixes')->orderBy('suffix', 'ASC')->get()->getResultArray(),
            'synonyms' => $this->db->table('chatbot_synonyms')->orderBy('word', 'ASC')->get()->getResultArray(),
        ];

SELECT `id`, `name`
FROM `chatbot_intents`
ORDER BY `name` ASC
---
    public function getSimpleIntents(): array
    {
        $this->ensureSchema();

        return $this->select('id, name')
            ->orderBy('name', 'ASC')
            ->findAll();

SELECT *
FROM `chatbot_intents`
ORDER BY `priority` DESC, `id` DESC
---
    public function getIntentRows(string $keyword = '', string $status = ''): array
    {
        $this->ensureSchema();

        $builder = $this->orderBy('priority', 'DESC')->orderBy('id', 'DESC');

        if ($status !== '') {
            $builder->where('status', $status);
        }

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('name', $keyword)
                ->orLike('response', $keyword)
                ->orLike('source', $keyword)
                ->groupEnd();
        }

        return $builder->findAll();

SELECT `p`.*, `i`.`name` AS `intent_name`
FROM `chatbot_training_phrases` `p`
JOIN `chatbot_intents` `i` ON `i`.`id` = `p`.`intent_id`
ORDER BY `i`.`name` ASC, `p`.`id` DESC
---
    public function getTrainingPhraseRows(string $keyword = '', int $intentId = 0): array
    {
        $this->ensureSchema();
        $builder = $this->db->table('chatbot_training_phrases p')
            ->select('p.*, i.name AS intent_name')
            ->join('chatbot_intents i', 'i.id = p.intent_id')
            ->orderBy('i.name', 'ASC')
            ->orderBy('p.id', 'DESC');

        if ($intentId > 0) {
            $builder->where('p.intent_id', $intentId);
        }

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('p.phrase', $keyword)
                ->orLike('i.name', $keyword)
                ->groupEnd();
        }

        return $builder->get()->getResultArray();

SELECT `k`.*, `i`.`name` AS `intent_name`
FROM `chatbot_keywords` `k`
JOIN `chatbot_intents` `i` ON `i`.`id` = `k`.`intent_id`
ORDER BY `i`.`name` ASC, `k`.`keyword` ASC
---
    public function getKeywordRows(string $keyword = '', int $intentId = 0): array
    {
        $this->ensureSchema();
        $builder = $this->db->table('chatbot_keywords k')
            ->select('k.*, i.name AS intent_name')
            ->join('chatbot_intents i', 'i.id = k.intent_id')
            ->orderBy('i.name', 'ASC')
            ->orderBy('k.keyword', 'ASC');

        if ($intentId > 0) {
            $builder->where('k.intent_id', $intentId);
        }

        if ($keyword !== '') {
            $builder->groupStart()
                ->like('k.keyword', $keyword)
                ->orLike('i.name', $keyword)
                ->groupEnd();
        }

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `chatbot_synonyms`
WHERE `word` = 'dibuka'
---
    private function seedNlpDefaults(): void
    {
        $now = date('Y-m-d H:i:s');
        $this->insertUniqueRows('chatbot_stopwords', 'word', ['apa', 'aja', 'saja', 'yang', 'untuk', 'di', 'ke', 'itu', 'ini'], $now);
        $this->insertUniqueRows('chatbot_suffixes', 'suffix', ['nya', 'lah', 'kah', 'pun'], $now);

        $synonyms = [
            'dibuka' => 'pendaftaran',
            'mulai' => 'pendaftaran',
            'pendaftar' => 'pendaftaran',
            'persyaratan' => 'syarat',
            'syaratnya' => 'syarat',
            'daftar' => 'pendaftaran',
            'mendaftar' => 'pendaftaran',
            'mendaftarkan' => 'pendaftaran',
            'lokasi' => 'alamat',
            'dimana' => 'alamat',
            'mana' => 'alamat',
            'sekolahnya' => 'sekolah',
        ];

        foreach ($synonyms as $word => $normalizedWord) {
            if (!$this->db->table('chatbot_synonyms')->where('word', $word)->countAllResults()) {

SELECT COUNT(*) AS `numrows`
FROM `chatbot_intents`
---
    private function seedDefaultIntents(): void
    {
        if ((int) $this->countAllResults() > 0) {